//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2010, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************
//**********************************************************************
//
// $Header: $
//
// $Revision: $
//
// $Date: $
//
//**********************************************************************
// Revision History
// ----------------
// $Log: $
// 
//
//**********************************************************************

//<AMI_FHDR_START>
//----------------------------------------------------------------------------
//
// Name:            IccSetup.uni
//
// Description:     String file for ICC Setup
//
//----------------------------------------------------------------------------
//<AMI_FHDR_END>
//*++
//
//Copyright (c)  2009 Intel Corporation. All rights reserved
//This software and associated documentation (if any) is furnished
//under a license and may only be used or copied in accordance
//with the terms of the license. Except as permitted by such
//license, no part of this software or documentation may be
//reproduced, stored in a retrieval system, or transmitted in any
//form or by any means without the express written consent of
//Intel Corporation.
//
//Module Name:
//
//  IccStrings.uni
//
//Abstract:
//
// Strings for Icc advanced menu.
//
//--*/
/=#
#include "VFR.uni"

#string STR_ICC_FORM                    #language eng "Intel ICC"
#string STR_ICC_FORM_HELP               #language eng "Integrated Clock Control options"
#string STR_ICC_LIB_VERSION             #language eng "ICC Overclocking Lib"
#string STR_ICC_LIB_VERSION_NR          #language eng "N/A"
#string STR_ICC_ADVANCED                #language eng "Advanced options"
#string STR_ICC_ADVANCED_HELP           #language eng "Displays advanced ICC options"
#string STR_ICC_OVERCLOCKING            #language eng "Clock Manipulation"

#string STR_ICC_CLOCK_ENABLING          #language eng "Turn off unused PCI/PCIe clocks"
#string STR_ICC_CLOCK_ENABLING_HELP     #language eng "Disabled: all clocks turned on. Enabled : clocks for empty PCI/PCIe slots will be turned off to save power. Platform must be powered off for changes to take effect."
#string STR_ICC_LOCK_EOP                #language eng "ICC Locks After EOP"
#string STR_ICC_LOCK_HELP               #language eng "Lock ICC register After EOP."
#string STR_ICC_DEFAULT                 #language eng "Default"
#string STR_ICC_LOCK                    #language eng "All Locked"
#string STR_ICC_UNLOCK                  #language eng "All UnLocked"
#string STR_ICC_WDT_ENABLE              #language eng "Use Watchdog Timer for ICC"
#string STR_ICC_WDT_ENABLE_HELP         #language eng "Enable Watchdog Timer operation for ICC. If enabled, Watchdog Timer will be started after ICC-related changes. This timer detects platform instability caused by wrong clock settings."

#string STR_ICC_PROFILE                 #language eng "ICC Profile"
#string STR_ICC_PROFILE_HELP            #language eng "Choose clock profile"

#string STR_ICC_ENABLE                 #language eng "ICC Profile Enable for Test pass !!!!"
#string STR_ICC_ENABLE_HELP            #language eng "ICC Profile Enable for Test pass !!!!"

#string STR_ICC_SUBFORM1                #language eng "Clock1"
#string STR_ICC_SUBFORM2                #language eng "Clock2"
#string STR_ICC_SUBFORM3                #language eng "Clock3"
#string STR_ICC_SUBFORM4                #language eng "Clock4"
#string STR_ICC_SUBFORM5                #language eng "Clock5"
#string STR_ICC_SUBFORM6                #language eng "Clock6"
#string STR_ICC_SUBFORM7                #language eng "Clock7"
#string STR_ICC_SUBFORM8                #language eng "Clock8"

#string STR_ICC_CLOCK_NUMBER                #language eng "placeholder for clock number"
#string STR_ICC_CLOCK_USAGE_1               #language eng "placeholder for clock usage"
#string STR_ICC_CLOCK_USAGE_2               #language eng "placeholder for clock usage"

#string STR_ICC_NEW_FREQUENCY               #language eng "New frequency [10kHz]"
#string STR_ICC_NEW_FREQUENCY_HELP          #language eng "Requested frequency in 10kHz increments. Frequency is automatically rounded down to nearest valid value. Changes will not be applied unless 'Accept changes' is pressed."
#string STR_ICC_SSC_MODE_SELECTION          #language eng "New SSC Mode:"
#string STR_ICC_SSC_MODE_SELECTION_HELP     #language eng "Requested SSC mode. Changes will not be applied unless 'Accept changes' is pressed."
#string STR_ICC_MODE_UP                     #language eng "up"
#string STR_ICC_MODE_CENTRE                 #language eng "center"
#string STR_ICC_MODE_DOWN                   #language eng "down"
#string STR_ICC_SSC_NEW_PERCENT             #language eng "New SSC spread percent [0.01%]"
#string STR_ICC_SSC_NEW_PERCENT_HELP        #language eng "Requested SSC percent in 0.01% increments. Changes will not be applied unless 'Accept changes' is pressed."
#string STR_ICC_PERMANENT_SELECTION         #language eng "Apply every boot?"
#string STR_ICC_PERMANENT_SELECTION_HELP    #language eng "No = Settings will be used only once and discarded. Yes = Settings will be written to flash and used after every reboot."
#string STR_YES                             #language eng "yes"
#string STR_NO                              #language eng "no"
#string STR_ICC_IMMEDIATE_CHANGES           #language eng "Apply settings immediately"
#string STR_ICC_IMMEDIATE_CHANGES_HELP      #language eng "Changes will be applied immediately, but forgotten after reboot. This mode of making changes is more likely to cause platform instability and spontaneous restart."
#string STR_ICC_ONETIME_CHANGES             #language eng "Apply settings once after reboot"
#string STR_ICC_ONETIME_CHANGES_HELP        #language eng "Changes will be applied once, after the next reboot, and then forgotten. Use it to try changes that are too aggressive for immediate application"
#string STR_ICC_PERMANENT_CHANGES           #language eng "Apply settings permanently after reboot"
#string STR_ICC_PERMANENT_CHANGES_HELP      #language eng "Changes will be applied permanently, starting after the next reboot. Use it to provide changes that are verified and safe."

#string STR_ICC_MAX_FREQUENCY               #language eng "Maximum supported frequency"
#string STR_ICC_MIN_FREQUENCY               #language eng "Minimum supported frequency"
#string STR_ICC_CURRENT_FREQUENCY           #language eng "Current frequency"
#string STR_ICC_SSC_MODES                   #language eng "Supported SSC modes"
#string STR_ICC_SSC_CURRENT_MODE            #language eng "Current SSC mode"
#string STR_ICC_SSC_MAX                     #language eng "Maximum supported SSC %"
#string STR_ICC_SSC_CURRENT                 #language eng "Current SSC %"

#string STR_DMI_PEG_RATIO                   #language eng "DMI/PEG Ratio"
#string STR_DMI_PEG_RATIO_HELP              #language eng "DMI/PEG Ratio Help"
#string STR_DMI_PEG_RATIO_55                #language eng "5:5"
#string STR_DMI_PEG_RATIO_54                #language eng "5:4"
#string STR_DMI_PEG_RATIO_53                #language eng "5:3"
#string STR_DMI_PEG_RATIO_52                #language eng "5:2"

#string STR_ICC_MAX_FREQUENCY_VALUE         #language eng "many MHz"
#string STR_ICC_MIN_FREQUENCY_VALUE         #language eng "many MHz"
#string STR_ICC_CURRENT_FREQUENCY_VALUE     #language eng "many MHz"
#string STR_ICC_SSC_MODES_VALUE             #language eng "many MHz"
#string STR_ICC_SSC_CURRENT_MODE_VALUE      #language eng "many MHz"
#string STR_ICC_SSC_MAX_VALUE               #language eng "many MHz"
#string STR_ICC_SSC_CURRENT_VALUE           #language eng "many MHz"

#string STR_ICC_ZERO                        #language eng "0"

#string STR_ICC_MSGBOX_BAD_PROTOCOL         #language eng "ICC Overclocking unavailable: Library failed to load."
#string STR_ICC_MSGBOX_AFTER_EOP            #language eng "ICC Overclocking unavailable: Library disabled after End Of Post event."
#string STR_ICC_MSGBOX_INIT_ERROR_FW        #language eng "ICC Overclocking unavailable: Library failed to initialize due to firmware error."
#string STR_ICC_MSGBOX_INIT_ERROR_HECI      #language eng "ICC Overclocking unavailable: Library failed to initialize due to HECI error."
#string STR_ICC_MSGBOX_INIT_ERROR_STRANGE   #language eng "ICC Overclocking unavailable: Library failed to initialize."

#string STR_ICC_MSGBOX_ONCE_OVERWRITE       #language eng "Permanent and temporary changes are mutually exclusive. All previous clock changes made with 'permanent' option will be lost. Proceed?"
#string STR_ICC_MSGBOX_PERM_OVERWRITE       #language eng "Permanent and temporary changes are mutually exclusive. All previous clock changes made with 'once' option will be lost. Proceed?"
#string STR_ICC_MSGBOX_NO_DYNAMIC           #language eng "Error: The change cannot be performed immediately. Try using 'once' or 'permanent' option to perform clock change after reboot."
#string STR_ICC_MSGBOX_LOCKED               #language eng "Error: Overclocking registers locked, can't apply changes."
#string STR_ICC_MSGBOX_FREQ_HIGH            #language eng "Error: Frequency too high for clock %s."
#string STR_ICC_MSGBOX_FREQ_LOW             #language eng "Error: Frequency too low for clock %s."
#string STR_ICC_MSGBOX_SSC_HIGH             #language eng "Error: SSC parameter too high for clock %s."
#string STR_ICC_MSGBOX_SSC_LOW              #language eng "Error: SSC parameter too low for clock %s. Increase it or set to 0%%."
#string STR_ICC_MSGBOX_NO_STORAGE           #language eng "Error: Too many clock change requests were made using 'once' option - data doesn't fit in temporary storage."
#string STR_ICC_MSGBOX_SSC_MODE             #language eng "Error: Unsupported SSC mode selected for clock %s."
#string STR_ICC_MSGBOX_SSC_DISABLED         #language eng "Error: SSC is not supported for selected frequency for clock %s. SSC must be set to 0%%."
#string STR_ICC_MSGBOX_SSC_CONSTANT         #language eng "Error: SSC cannot be changed for clock %s."
#string STR_ICC_MSGBOX_HECI                 #language eng "Error: HECI communications failed."
#string STR_ICC_MSGBOX_SUCCESS              #language eng "Success."
#string STR_ICC_MSGBOX_UNKNOWN              #language eng "Unrecognized error. Code = 0x%08x."
#string STR_ICC_MSGBOX_SUCCESS_NEED_REBOOT  #language eng "Success. Settings will take effect after reboot."

//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2010, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************